In [18]:
import pandas as pd
import numpy as np

In [19]:
data = pd.read_csv("C:\\Users\\HP\\Downloads\\Titanic-Dataset.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
data.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'],axis='columns', inplace=True)
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [32]:
target = data.Survived 
inputs = data.drop('Survived', axis='columns')

In [33]:
# convert test column 'sex' into numeric
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
data['Sex'] = encoder.fit_transform(data['Sex'])

print(data)

     Survived  Pclass  Sex   Age     Fare  Sex_c
0           0       3    1  22.0   7.2500      1
1           1       1    0  38.0  71.2833      0
2           1       3    0  26.0   7.9250      0
3           1       1    0  35.0  53.1000      0
4           0       3    1  35.0   8.0500      1
..        ...     ...  ...   ...      ...    ...
886         0       2    1  27.0  13.0000      1
887         1       1    0  19.0  30.0000      0
888         0       3    0   NaN  23.4500      0
889         1       1    1  26.0  30.0000      1
890         0       3    1  32.0   7.7500      1

[891 rows x 6 columns]

In [34]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  Sex_c
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [36]:
# check null values
inputs.columns[inputs.isnull().any()]

Index(['Age'], dtype='object')

In [37]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [39]:
# we take mean of entire column and fill null value with mean
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  Sex_c
0       3  22.000000   7.2500      1
1       1  38.000000  71.2833      0
2       3  26.000000   7.9250      0
3       1  35.000000  53.1000      0
4       3  35.000000   8.0500      1
5       3  29.699118   8.4583      1
6       1  54.000000  51.8625      1
7       3   2.000000  21.0750      1
8       3  27.000000  11.1333      0
9       2  14.000000  30.0708      0

In [65]:
# split data into training and testing
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [66]:
len(X_train)

712

In [67]:
len(X_test)

179

In [68]:
len(inputs)

891

In [69]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [70]:
model.fit(X_train, y_train)

GaussianNB()

In [71]:
model.score(X_test, y_test)

0.8044692737430168

In [72]:
X_test[:10]

     Pclass        Age     Fare  Sex_c
419       3  10.000000  24.1500      0
381       3   1.000000  15.7417      0
49        3  18.000000  17.8000      0
573       3  29.699118   7.7500      0
131       3  20.000000   7.0500      1
886       2  27.000000  13.0000      1
874       2  28.000000  24.0000      0
862       1  48.000000  25.9292      0
282       3  16.000000   9.5000      1
34        1  28.000000  82.1708      1

In [73]:
y_test[:10]

419    0
381    1
49     0
573    1
131    0
886    0
874    1
862    1
282    0
34     0
Name: Survived, dtype: int64

In [75]:
model.predict(X_test[:10])

array([1, 1, 1, 1, 0, 0, 1, 1, 0, 1], dtype=int64)

In [76]:
model.predict_proba(X_test[:10])

array([[0.2845155 , 0.7154845 ],
       [0.22460523, 0.77539477],
       [0.34521208, 0.65478792],
       [0.39313164, 0.60686836],
       [0.95300408, 0.04699592],
       [0.9106121 , 0.0893879 ],
       [0.21222047, 0.78777953],
       [0.06109582, 0.93890418],
       [0.94853597, 0.05146403],
       [0.38495662, 0.61504338]])